import React from 'react'
import Services from '../services/Services';
import './Main.css'
function Main({ polygon, polygon2, active, setActive }) {


  const backgroundImage = '../../../static/tinyImg/backgroundImage.png';

  const truck = <svg width="107" height="80" viewBox="0 0 107 80" fill="none" xmlns="http://www.w3.org/2000/svg">
    <g clipPath="url(#clip0_439_1086)">
      <g filter="url(#filter0_d_439_1086)">
        <path d="M5.6875 0C2.54688 0 0 2.55469 0 5.6875V58C0 61.1328 2.85938 64 6 64H14.1875C15.1406 69.6719 20.0625 74 26 74C31.9375 74 36.8594 69.6719 37.8125 64H56.3125C59.4453 64 62 61.4453 62 58.3125V5.8125C62 2.60938 59.4766 0 56.375 0H5.6875ZM66 14V64C66.9609 69.6641 72.0625 74 78 74C83.9375 74 88.8594 69.6641 89.8125 64H94C97.1406 64 100 61.1406 100 58V38.75C100 34.7266 97.1016 30.6172 96.75 30.125L88.4375 19C86.5312 16.7031 83.5391 14 80 14H66ZM76 24H87.1875L93.5625 32.5C94.2422 33.4609 96 36.4062 96 38.75V40H76C74 40 72 38 72 36V28C72 25.7891 74 24 76 24ZM26 54C30.4141 54 34 57.5859 34 62C34 66.4141 30.4141 70 26 70C21.5859 70 18 66.4141 18 62C18 57.5859 21.5859 54 26 54ZM78 54C82.4141 54 86 57.5859 86 62C86 66.4141 82.4141 70 78 70C73.5859 70 70 66.4141 70 62C70 57.5859 73.5859 54 78 54Z" fill="#AB4D74" />
      </g>
    </g>
    <defs>
      <filter id="filter0_d_439_1086" x="0" y="0" width="108" height="82" filterUnits="userSpaceOnUse" colorInterpolationFilters="sRGB">
        <feFlood floodOpacity="0" result="BackgroundImageFix" />
        <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
        <feOffset dx="4" dy="4" />
        <feGaussianBlur stdDeviation="2" />
        <feComposite in2="hardAlpha" operator="out" />
        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.5 0" />
        <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_439_1086" />
        <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_439_1086" result="shape" />
      </filter>
      <clipPath id="clip0_439_1086">
        <rect width="107" height="80" fill="white" />
      </clipPath>
    </defs>
  </svg>


  //raindrop_svg 
  const raindrop = <svg width="84" height="90" viewBox="0 0 84 90" fill="none" xmlns="http://www.w3.org/2000/svg">
    <g clipPath="url(#clip0_439_1091)">
      <g filter="url(#filter0_d_439_1091)">
        <path d="M67.9566 37.4802L42.0002 0L16.0441 37.4802C5.29913 52.9954 11.2413 74.7307 28.4861 82.1363C32.6377 83.9195 37.205 84.9057 42.0002 84.9057C46.7955 84.9057 51.3628 83.9195 55.5146 82.1364C72.7593 74.7307 78.7012 52.9954 67.9566 37.4802Z" fill="#AB4D74" />
      </g>
      <path d="M44.0805 64.4974C44.0805 63.3774 43.6805 62.4374 42.8805 61.6774C42.1205 60.8774 41.2005 60.4774 40.1205 60.4774C39.0805 60.4774 38.1405 60.8574 37.3005 61.6174C36.5005 62.3774 36.1005 63.3374 36.1005 64.4974C36.1005 65.6174 36.4805 66.5774 37.2405 67.3774C38.0405 68.1374 39.0005 68.5174 40.1205 68.5174C41.2805 68.5174 42.2205 68.1174 42.9405 67.3174C43.7005 66.4774 44.0805 65.5374 44.0805 64.4974ZM31.3605 42.1774C30.6405 42.1774 29.9405 41.8574 29.2605 41.2174C28.6205 40.5774 28.3005 39.6774 28.3005 38.5174C28.3005 36.7974 28.6605 35.2774 29.3805 33.9574C30.1405 32.6374 31.1405 31.5374 32.3805 30.6574C33.6605 29.7774 35.1005 29.1174 36.7005 28.6774C38.3005 28.2374 39.9805 28.0174 41.7405 28.0174C43.9005 28.0174 45.8205 28.2974 47.5005 28.8574C49.2205 29.3774 50.6605 30.0974 51.8205 31.0174C53.0205 31.9374 53.9405 32.9974 54.5805 34.1974C55.2205 35.3974 55.5405 36.6574 55.5405 37.9774C55.5405 39.8174 54.9005 41.5974 53.6205 43.3174C52.3805 44.9974 50.4405 46.6374 47.8005 48.2374C46.9605 48.7574 46.1205 49.2774 45.2805 49.7974C44.4805 50.2774 43.7605 50.8774 43.1205 51.5974C42.4805 52.3174 41.9605 53.2174 41.5605 54.2974C41.1605 55.3374 40.9605 56.6574 40.9605 58.2574H39.1005C39.1005 56.1374 39.3205 54.3374 39.7605 52.8574C40.2405 51.3774 40.8205 50.0974 41.5005 49.0174C42.2205 47.9374 42.9805 46.9974 43.7805 46.1974C44.5805 45.3974 45.3205 44.5974 46.0005 43.7974C46.7205 42.9974 47.3005 42.1374 47.7405 41.2174C48.2205 40.2974 48.4605 39.1774 48.4605 37.8574C48.4605 36.8174 48.2205 35.8574 47.7405 34.9774C47.3005 34.0574 46.6805 33.2774 45.8805 32.6374C45.0805 31.9574 44.1605 31.4374 43.1205 31.0774C42.0805 30.6774 40.9805 30.4774 39.8205 30.4774C38.6205 30.4774 37.4405 30.6574 36.2805 31.0174C35.1605 31.3374 34.1605 31.8174 33.2805 32.4574C32.4005 33.0974 31.7005 33.8974 31.1805 34.8574C30.6605 35.7774 30.4005 36.8174 30.4005 37.9774C30.7605 37.7374 31.1605 37.6174 31.6005 37.6174C32.2405 37.6174 32.8005 37.8174 33.2805 38.2174C33.7605 38.6174 34.0005 39.1374 34.0005 39.7774C34.0005 40.4974 33.7205 41.0774 33.1605 41.5174C32.6405 41.9574 32.0405 42.1774 31.3605 42.1774Z" fill="white" />
    </g>
    <defs>
      <filter id="filter0_d_439_1091" x="10.6597" y="0" width="70.6812" height="92.9058" filterUnits="userSpaceOnUse" colorInterpolationFilters="sRGB">
        <feFlood floodOpacity="0" result="BackgroundImageFix" />
        <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
        <feOffset dx="4" dy="4" />
        <feGaussianBlur stdDeviation="2" />
        <feComposite in2="hardAlpha" operator="out" />
        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.5 0" />
        <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_439_1091" />
        <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_439_1091" result="shape" />
      </filter>
      <clipPath id="clip0_439_1091">
        <rect width="84" height="90" fill="white" />
      </clipPath>
    </defs>
  </svg>

  //dollar_svg
  const dollar = <svg width="88" height="96" viewBox="0 0 88 96" fill="none" xmlns="http://www.w3.org/2000/svg">
    <g filter="url(#filter0_d_584_2)">
      <circle cx="40" cy="46" r="40" fill="#AB4D74" />
    </g>
    <path d="M39.34 64.42L38.92 68.62H36.82L37.24 64.54C36.36 64.54 35.26 64.42 33.94 64.18C32.62 63.94 31.34 63.5 30.1 62.86C28.9 62.22 27.86 61.32 26.98 60.16C26.14 59 25.72 57.5 25.72 55.66C25.72 55.06 25.96 54.54 26.44 54.1C26.96 53.62 27.52 53.38 28.12 53.38C28.68 53.38 29.16 53.58 29.56 53.98C30 54.34 30.22 54.84 30.22 55.48C30.22 56.64 29.54 57.22 28.18 57.22C28.02 57.22 27.84 57.22 27.64 57.22C27.48 57.18 27.3 57.14 27.1 57.1C27.34 58.34 27.86 59.34 28.66 60.1C29.5 60.86 30.42 61.46 31.42 61.9C32.46 62.34 33.5 62.64 34.54 62.8C35.62 62.96 36.56 63.04 37.36 63.04L38.98 47.02C37.54 45.94 36.22 44.9 35.02 43.9C33.86 42.9 32.86 41.88 32.02 40.84C31.18 39.76 30.54 38.62 30.1 37.42C29.66 36.22 29.44 34.9 29.44 33.46C29.44 30.7 30.46 28.56 32.5 27.04C34.58 25.48 37.56 24.6 41.44 24.4L41.74 20.98H43.96L43.66 24.4C46.46 24.56 48.72 25.16 50.44 26.2C52.16 27.24 53.02 28.48 53.02 29.92C53.02 31.72 52.48 33.14 51.4 34.18C50.32 35.18 49.02 35.68 47.5 35.68C45.86 35.68 44.78 35.26 44.26 34.42C45.06 34.42 45.78 34 46.42 33.16C47.1 32.32 47.44 31.14 47.44 29.62C47.44 27.58 46.1 26.32 43.42 25.84L41.92 40.36C43.04 41.12 44.18 41.86 45.34 42.58C46.5 43.3 47.5 43.96 48.34 44.56C49.82 45.64 50.98 46.9 51.82 48.34C52.66 49.74 53.08 51.34 53.08 53.14C53.08 54.98 52.72 56.58 52 57.94C51.32 59.26 50.36 60.38 49.12 61.3C47.88 62.18 46.42 62.88 44.74 63.4C43.1 63.92 41.3 64.26 39.34 64.42ZM39.76 39.1L41.26 25.78C39.7 26.02 38.32 26.66 37.12 27.7C35.92 28.7 35.32 30.1 35.32 31.9C35.32 34.46 36.8 36.86 39.76 39.1ZM39.52 62.74C41.4 62.26 42.76 61.36 43.6 60.04C44.44 58.72 44.86 57.32 44.86 55.84C44.86 53.32 43.58 50.92 41.02 48.64L39.52 62.74Z" fill="white" />
    <defs>
      <filter id="filter0_d_584_2" x="0" y="6" width="88" height="88" filterUnits="userSpaceOnUse" colorInterpolationFilters="sRGB">
        <feFlood floodOpacity="0" result="BackgroundImageFix" />
        <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
        <feOffset dx="4" dy="4" />
        <feGaussianBlur stdDeviation="2" />
        <feComposite in2="hardAlpha" operator="out" />
        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.5 0" />
        <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_584_2" />
        <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_584_2" result="shape" />
      </filter>
    </defs>
  </svg>

  //barrel_svg
  const barrel = <svg width="100" height="106" viewBox="0 0 100 106" fill="none" xmlns="http://www.w3.org/2000/svg">
    <g clipPath="url(#clip0_439_1082)">
      <g filter="url(#filter0_d_439_1082)">
        <path d="M87.3356 94.7362H86.0164V68.3979C87.3592 68.2785 88.4162 67.1636 88.4162 65.7892C88.4162 64.4148 87.3598 63.2999 86.0164 63.1804V36.8191C87.3592 36.6996 88.4162 35.5847 88.4162 34.2103C88.4162 32.8359 87.3598 31.721 86.0164 31.6015V5.26385H87.3356C88.7889 5.26385 89.9675 4.08527 89.9675 2.63193C89.9675 1.17858 88.7889 0 87.3356 0H83.3845H16.6152H12.6642C11.2108 0 10.0322 1.17858 10.0322 2.63193C10.0322 4.08527 11.2108 5.26385 12.6642 5.26385H13.9833V31.6021C12.6405 31.7215 11.5835 32.8364 11.5835 34.2108C11.5835 35.5852 12.6405 36.7001 13.9833 36.8196V63.1809C12.6405 63.3004 11.5835 64.4153 11.5835 65.7897C11.5835 67.1641 12.6405 68.279 13.9833 68.3985V94.7367H12.6642C11.2108 94.7367 10.0322 95.9153 10.0322 97.3686C10.0322 98.822 11.2108 100.001 12.6642 100.001H16.6152H83.3845H87.3356C88.7889 100.001 89.9675 98.822 89.9675 97.3686C89.9675 95.9153 88.7889 94.7362 87.3356 94.7362ZM70.3281 50.3103C70.3281 61.5191 61.209 70.6382 50.0001 70.6382C38.7913 70.6382 29.6722 61.5191 29.6722 50.3103C29.6722 39.1015 38.7913 29.9824 50.0001 29.9824C61.209 29.9824 70.3281 39.1015 70.3281 50.3103ZM23.7688 92.5953C23.7688 94.0487 22.5902 95.2273 21.1368 95.2273C19.6835 95.2273 18.5049 94.0487 18.5049 92.5953V71.3189C18.5049 69.8655 19.6835 68.6869 21.1368 68.6869C22.5902 68.6869 23.7688 69.8655 23.7688 71.3189V92.5953ZM23.7688 59.6063C23.7688 61.0596 22.5902 62.2382 21.1368 62.2382C19.6835 62.2382 18.5049 61.0596 18.5049 59.6063V39.1294C18.5049 37.676 19.6835 36.4974 21.1368 36.4974C22.5902 36.4974 23.7688 37.676 23.7688 39.1294V59.6063ZM23.7688 27.6284C23.7688 29.0817 22.5902 30.2603 21.1368 30.2603C19.6835 30.2603 18.5049 29.0817 18.5049 27.6284V7.19358C18.5049 5.74023 19.6835 4.56165 21.1368 4.56165C22.5902 4.56165 23.7688 5.74023 23.7688 7.19358V27.6284ZM59.3545 55.2915C59.3545 60.4495 55.1582 64.6459 50.0001 64.6459C44.8421 64.6459 40.6457 60.4495 40.6457 55.2915C40.6457 54.0776 40.8789 52.8901 41.339 51.7621C41.3463 51.7437 41.3537 51.7263 41.3616 51.7079L47.5856 37.3633C48.003 36.4011 48.9516 35.7789 50.0001 35.7789H50.0017C51.0508 35.7794 51.9993 36.4032 52.4157 37.366L58.7434 51.9942C58.7665 52.0474 58.7876 52.1016 58.8071 52.1558C59.1703 53.1759 59.3545 54.2308 59.3545 55.2915Z" fill="#AB4D74" />
      </g>
      <circle cx="50" cy="50" r="23" fill="#AB4D74" />
      <path d="M58.282 48.4773L50 37L41.718 48.4773C38.2896 53.2284 40.1856 59.8842 45.688 62.152C47.0126 62.698 48.47 63 50 63C51.53 63 52.9874 62.698 54.3121 62.152C59.8145 59.8842 61.7104 53.2284 58.282 48.4773Z" fill="white" />
    </g>
    <defs>
      <filter id="filter0_d_439_1082" x="10.0322" y="0" width="87.9351" height="108" filterUnits="userSpaceOnUse" colorInterpolationFilters="sRGB">
        <feFlood floodOpacity="0" result="BackgroundImageFix" />
        <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
        <feOffset dx="4" dy="4" />
        <feGaussianBlur stdDeviation="2" />
        <feComposite in2="hardAlpha" operator="out" />
        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.5 0" />
        <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_439_1082" />
        <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_439_1082" result="shape" />
      </filter>
      <clipPath id="clip0_439_1082">
        <rect width="100" height="106" fill="white" />
      </clipPath>
    </defs>
  </svg>



  //serviceItems
  const allServices = [
    { id: 1, icon: barrel, header: "ПОСТАВКА", description: "бочками по 212л" },
    { id: 2, icon: dollar, header: "ЗАКУПКА", description: "растворителей по выгодным ценам" },
    { id: 3, icon: raindrop, header: "РАЗЛИТИЕ", description: "под Вашим брендом" },
    { id: 4, icon: truck, header: "ДОСТАВКА", description: "собственным транпортом или ж/д" },
  ]

  return (
    <div className='main'
      style={{
        background: `url(${backgroundImage})`,
        backgroundPosition: 'center',
        backgroundSize: 'cover',
        backgroundRepeat: 'no-repeat'
      }}
    >
      <div className="main__content">
        <ul><a name='Главная'></a><li>{polygon}Главная</li></ul>
        <h2>МЫ ПРОИЗВОДИМ</h2>
        <h3>растворители, моющие средства, автомобильную химию</h3>
        <div className="call">
          <div className="call-btn" onClick={() =>setActive(true)} >ЗАКАЗАТЬ ЗВОНОК {polygon2}</div>
          <div className="phone">8 (951) 916-34-94</div>
        </div>
      </div>
      <Services items={allServices} />
    </div>

  )
}

export default Main